Tekla Open API Reference for Tekla Structures 2025
LineSegment.Equals Method (Object)
 Returns true if the objects are equal.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object o
)
Public Overrides Function Equals (
	o As Object
) As Boolean
Parameters
o
Type: System.Object
The object that equality is wished to be checked with.
Return Value
Type: Boolean
True if the objects are equal.
See Also
Reference
LineSegment Class
Equals Overload
Tekla.Structures.Geometry3d Namespace